/******************************************************************************
*              (c), Copyright, FORCE COMPUTERS INDIA Limited                  *
*                                                                             *
* THIS CODE CONTAINS CONFIDENTIAL INFORMATION OF FORCE COMPUTERS, INC.        *
* NO RIGHTS ARE GRANTED HEREIN UNDER ANY PATENT, MASK WORK RIGHT OR COPYRIGHT *
* OF FORCE OR ANY THIRD PARTY. FORCE RESERVES THE RIGHT AT ITS SOLE DISCRETION*
* TO REQUEST THAT THIS CODE BE IMMEDIATELY RETURNED TO FORCE COMPUTERS.       *
* THIS CODE IS PROVIDED "AS IS". FORCE COMPUTERS MAKES NO WARRANTIES, EXPRESS,*
* IMPLIED OR OTHERWISE, REGARDING ITS ACCURACY, COMPLETENESS OR PERFORMANCE.  *
*******************************************************************************
*                                                                             *
* Filename:structs.h                                                          *
*                                                                             *
* DESCRIPTION:	                                                              *
*       This file is generated by Regparse tool.                              *
*                                                                             *
* DEPENDENCIES:	                                                              *
*       None.                                                                 *
*                                                                             *
******************************************************************************/

/* typedefs */
typedef struct 
    {
    UINT32  base;                       /* 0x0: base address for this window */
    UINT8   pad1[4];                    /* UNUSED: 0x4 */
    UINT32  size;                       /* 0x8: Size of the window */
    } DCD_REGS;


typedef struct 
    {
    UINT32  base;                       /* 0x0 */
    } PCI_DCD_REGS;


typedef struct 
    {
    UINT32  remap;                      /* 0x0 */
    } PCI_REMAP_REGS;


typedef struct 
    {
    UINT32  x;                          /* 0x0 */
    } MPSC_CAUSE_REGS;


typedef struct 
    {
    UINT32  cfg;                        /* 0x0 */
    UINT32  tune;                       /* 0x4 */
    } BRG_REGS;


typedef struct 
    {
    UINT8   base[0];                    /* 0x0 */
    UINT32  mainCfgLow;                 /* 0x0 */
    UINT32  mainCfgHi;                  /* 0x4 */
    UINT32  protoCfg;                   /* 0x8 */
    UINT32  reg1;                       /* 0xc */
    UINT32  reg2;                       /* 0x10: page:257 */
    UINT32  reg3;                       /* 0x14: page:258 */
    UINT32  reg4;                       /* 0x18 */
    UINT32  reg5;                       /* 0x1c: page:259 */
    UINT32  reg6;                       /* 0x20 */
    UINT32  reg7;                       /* 0x24 */
    UINT32  reg8;                       /* 0x28 */
    UINT32  reg9;                       /* 0x2c */
    UINT32  reg10;                      /* 0x30: Page:260 */
    } MPSC_REGS;


typedef struct 
    {
    UINT16  size;                       /* 0x0: Buffer size */
    UINT16  bcount;                     /* 0x2: Byte Count */
    UINT32  cs;                         /* 0x4: Control/Status */
    UINT32  next;                       /* 0x8: Next buffer */
    UINT32  bptr;                       /* 0xc: Buffer pointer */
    } SDMA_RXBD_REGS;


typedef struct 
    {
    UINT16  bcount;                     /* 0x0: Buffer Size */
    UINT16  shadow;                     /* 0x2: Shadow size */
    UINT32  cs;                         /* 0x4: Control/Status */
    UINT32  next;                       /* 0x8: Next buffer */
    UINT32  bptr;                       /* 0xc: Buffer pointer */
    } SDMA_TXBD_REGS;


typedef struct 
    {
    UINT32  cpuConfiguration;           /* 0x0 */
    UINT32  lowIrqCause;                /* 0x4 */
    UINT32  cs0Decode;                  /* 0x8 */
    UINT32  hiIrqCause;                 /* 0xc */
    UINT32  cs0DecodeSize;              /* 0x10 */
    UINT32  cpu0IrqMaskLow;             /* 0x14 */
    UINT32  cs2Decode;                  /* 0x18 */
    UINT32  cpu0IrqMaskHi;              /* 0x1c */
    UINT32  cs2DecodeSize;              /* 0x20 */
    UINT32  cpu0SelectCause;            /* 0x24 */
    UINT32  dcs0Decode;                 /* 0x28 */
    UINT8   pad1[4];                    /* UNUSED: 0x2c */
    UINT32  dcs0DecodeSize;             /* 0x30 */
    UINT32  cpu1IrqMaskLow;             /* 0x34 */
    UINT32  dcs3Decode;                 /* 0x38 */
    UINT32  cpu1IrqMaskHi;              /* 0x3c */
    UINT32  dcs3DecodeSize;             /* 0x40 */
    UINT32  cpu1SelectCause;            /* 0x44 */
    UINT32  pci0IoDecode;               /* 0x48 */
    UINT8   pad2[4];                    /* UNUSED: 0x4c */
    UINT32  pci0IoDecodeSize;           /* 0x50 */
    UINT32  int0IrqCauseMaskLow;        /* 0x54 */
    PCI_DCD_REGS pci0Mem0Decode;        /* 0x58 */
    UINT32  int0IrqCauseMaskHi;         /* 0x5c */
    UINT32  pci0Mem0DecodeSize;         /* 0x60 */
    UINT32  int0SelectCause;            /* 0x64 */
    UINT32  internalSpaceBase;          /* 0x68 */
    UINT8   pad3[4];                    /* UNUSED: 0x6c */
    UINT32  cpuErrorAdrsLow;            /* 0x70 */
    UINT32  int1IrqCauseMaskLow;        /* 0x74 */
    UINT32  cpuErrorAdrsHi;             /* 0x78 */
    UINT32  int1IrqCauseMaskHi;         /* 0x7c */
    PCI_DCD_REGS pci0Mem1Decode;        /* 0x80 */
    UINT32  int1SelectCause;            /* 0x84 */
    UINT32  pci0Mem1DecodeSize;         /* 0x88 */
    UINT8   pad4[4];                    /* UNUSED: 0x8c */
    PCI_DCD_REGS pci1IoDecode;          /* 0x90 */
    UINT8   pad5[4];                    /* UNUSED: 0x94 */
    UINT32  pci1IoDecodeSize;           /* 0x98 */
    UINT8   pad6[4];                    /* UNUSED: 0x9c */
    PCI_DCD_REGS pci1Mem0Decode;        /* 0xa0 */
    UINT8   pad7[4];                    /* UNUSED: 0xa4 */
    UINT32  pci1Mem0DecodeSize;         /* 0xa8 */
    UINT8   pad8[4];                    /* UNUSED: 0xac */
    PCI_DCD_REGS pci1Mem1Decode;        /* 0xb0 */
    UINT8   pad9[4];                    /* UNUSED: 0xb4 */
    UINT32  pci1Mem1DecodeSize;         /* 0xb8 */
    UINT8   pad10[4];                   /* UNUSED: 0xbc */
    UINT32  cpu0SyncBarierTrigger;      /* 0xc0 */
    UINT8   pad11[4];                   /* UNUSED: 0xc4 */
    UINT32  cpu0SyncBarierVirtual;      /* 0xc8 */
    UINT8   pad12[4];                   /* UNUSED: 0xcc */
    UINT32  cpu1SyncBarierTrigger;      /* 0xd0 */
    UINT8   pad13[4];                   /* UNUSED: 0xd4 */
    UINT32  cpu1SyncBarierVirtual;      /* 0xd8 */
    UINT8   pad14[20];                  /* UNUSED: 0xdc */
    PCI_REMAP_REGS pci0IoRemap;         /* 0xf0 */
    UINT8   pad15[4];                   /* UNUSED: 0xf4 */
    PCI_REMAP_REGS pci0Mem0Remap;       /* 0xf8 */
    UINT8   pad16[4];                   /* UNUSED: 0xfc */
    PCI_REMAP_REGS pci0Mem1Remap;       /* 0x100 */
    UINT8   pad17[4];                   /* UNUSED: 0x104 */
    PCI_REMAP_REGS pci1IoRemap;         /* 0x108 */
    UINT8   pad18[4];                   /* UNUSED: 0x10c */
    PCI_REMAP_REGS pci1Mem0Remap;       /* 0x110 */
    UINT8   pad19[4];                   /* UNUSED: 0x114 */
    PCI_REMAP_REGS pci1Mem1Remap;       /* 0x118 */
    UINT8   pad20[4];                   /* UNUSED: 0x11c */
    UINT32  cpuMode;                    /* 0x120 */
    UINT8   pad21[4];                   /* UNUSED: 0x124 */
    UINT32  cpuErrorDataLow;            /* 0x128 */
    UINT8   pad22[4];                   /* UNUSED: 0x12c */
    UINT32  cpuErrorDataHi;             /* 0x130 */
    UINT8   pad23[4];                   /* UNUSED: 0x134 */
    UINT32  cpuErrorParity;             /* 0x138 */
    UINT8   pad24[4];                   /* UNUSED: 0x13c */
    UINT32  cpuErrorCause;              /* 0x140 */
    UINT8   pad25[4];                   /* UNUSED: 0x144 */
    UINT32  cpuErrorMask;               /* 0x148 */
    UINT8   pad26[4];                   /* UNUSED: 0x14c */
    UINT32  cpuCrossBarCtrlLow;         /* 0x150 */
    UINT8   pad27[4];                   /* UNUSED: 0x154 */
    UINT32  cpuCrossBarCtrlHigh;        /* 0x158 */
    UINT8   pad28[4];                   /* UNUSED: 0x15c */
    UINT32  cpuMasterCtrl;              /* 0x160 */
    UINT8   pad29[4];                   /* UNUSED: 0x164 */
    UINT32  cpuCrossBarTimeout;         /* 0x168 */
    UINT8   pad30[20];                  /* UNUSED: 0x16c */
    UINT32  cpuProtBaseAdrs0;           /* 0x180 */
    UINT8   pad31[4];                   /* UNUSED: 0x184 */
    UINT32  cpuProtSize0;               /* 0x188 */
    UINT8   pad32[4];                   /* UNUSED: 0x18c */
    UINT32  cpuProtBaseAdrs1;           /* 0x190 */
    UINT8   pad33[4];                   /* UNUSED: 0x194 */
    UINT32  cpuProtSize1;               /* 0x198 */
    UINT8   pad34[4];                   /* UNUSED: 0x19c */
    UINT32  cpuProtBaseAdrs2;           /* 0x1a0 */
    UINT8   pad35[4];                   /* UNUSED: 0x1a4 */
    UINT32  cpuProtSize2;               /* 0x1a8 */
    UINT8   pad36[4];                   /* UNUSED: 0x1ac */
    UINT32  cpuProtBaseAdrs3;           /* 0x1b0 */
    UINT8   pad37[4];                   /* UNUSED: 0x1b4 */
    UINT32  cpuProtSize3;               /* 0x1b8 */
    UINT8   pad38[68];                  /* UNUSED: 0x1bc */
    UINT32  whoAmI;                     /* 0x200 */
    UINT8   pad39[4];                   /* UNUSED: 0x204 */
    UINT32  cs1Decode;                  /* 0x208 */
    UINT8   pad40[4];                   /* UNUSED: 0x20c */
    UINT32  cs1DecodeSize;              /* 0x210 */
    UINT32  cpu0DoorBell;               /* 0x214 */
    UINT32  cs3Decode;                  /* 0x218 */
    UINT32  cpu0DoorBellClear;          /* 0x21c */
    UINT32  cs3DecodeSize;              /* 0x220 */
    UINT32  cpu1DoorBell;               /* 0x224 */
    UINT32  dcs1Decode;                 /* 0x228 */
    UINT32  cpu1DoorBellClear;          /* 0x22c */
    UINT32  dcs1DecodeSize;             /* 0x230 */
    UINT32  cpu0DoorBellMask;           /* 0x234 */
    UINT32  bootcsDecode;               /* 0x238 */
    UINT32  cpu1DoorBellMask;           /* 0x23c */
    UINT32  bootcsDecodeSize;           /* 0x240 */
    UINT32  semaphore0;                 /* 0x244 */
    UINT32  dcs2Decode;                 /* 0x248 */
    UINT32  semaphore1;                 /* 0x24c */
    UINT32  dcs2DecodeSize;             /* 0x250 */
    UINT32  semaphore2;                 /* 0x254 */
    PCI_DCD_REGS pci0Mem2Decode;        /* 0x258 */
    UINT32  semaphore3;                 /* 0x25c */
    UINT32  pci0Mem2DecodeSize;         /* 0x260 */
    UINT32  semaphore4;                 /* 0x264 */
    UINT32  integratedSramBase;         /* 0x268 */
    UINT32  semaphore5;                 /* 0x26c */
    UINT8   pad41[4];                   /* UNUSED: 0x270 */
    UINT32  semaphore6;                 /* 0x274 */
    UINT32  baseAddrEnable;             /* 0x278 */
    UINT32  semaphore7;                 /* 0x27c */
    PCI_DCD_REGS pci0Mem3Decode;        /* 0x280 */
    UINT8   pad42[4];                   /* UNUSED: 0x284 */
    UINT32  pci0Mem3DecodeSize;         /* 0x288 */
    UINT8   pad43[20];                  /* UNUSED: 0x28c */
    PCI_DCD_REGS pci1Mem2Decode;        /* 0x2a0 */
    UINT8   pad44[4];                   /* UNUSED: 0x2a4 */
    UINT32  pci1Mem2DecodeSize;         /* 0x2a8 */
    UINT8   pad45[4];                   /* UNUSED: 0x2ac */
    PCI_DCD_REGS pci1Mem3Decode;        /* 0x2b0 */
    UINT8   pad46[4];                   /* UNUSED: 0x2b4 */
    UINT32  pci1Mem3DecodeSize;         /* 0x2b8 */
    UINT8   pad47[60];                  /* UNUSED: 0x2bc */
    PCI_REMAP_REGS pci0Mem2Remap;       /* 0x2f8 */
    UINT8   pad48[4];                   /* UNUSED: 0x2fc */
    PCI_REMAP_REGS pci0Mem3Remap;       /* 0x300 */
    UINT8   pad49[12];                  /* UNUSED: 0x304 */
    PCI_REMAP_REGS pci1Mem2Remap;       /* 0x310 */
    UINT8   pad50[4];                   /* UNUSED: 0x314 */
    PCI_REMAP_REGS pci1Mem3Remap;       /* 0x318 */
    UINT8   pad51[4];                   /* UNUSED: 0x31c */
    UINT32  pci0Mem0RemapHi;            /* 0x320 */
    UINT8   pad52[4];                   /* UNUSED: 0x324 */
    UINT32  pci0Mem1RemapHi;            /* 0x328 */
    UINT8   pad53[4];                   /* UNUSED: 0x32c */
    UINT32  pci0Mem2RemapHi;            /* 0x330 */
    UINT8   pad54[4];                   /* UNUSED: 0x334 */
    UINT32  pci0Mem3RemapHi;            /* 0x338 */
    UINT8   pad55[4];                   /* UNUSED: 0x33c */
    UINT32  pci1Mem0RemapHi;            /* 0x340 */
    UINT8   pad56[4];                   /* UNUSED: 0x344 */
    UINT32  pci1Mem1RemapHi;            /* 0x348 */
    UINT8   pad57[4];                   /* UNUSED: 0x34c */
    UINT32  pci1Mem2RemapHi;            /* 0x350 */
    UINT8   pad58[4];                   /* UNUSED: 0x354 */
    UINT32  pci1Mem3RemapHi;            /* 0x358 */
    UINT8   pad59[36];                  /* UNUSED: 0x35c */
    UINT32  sramCfg;                    /* 0x380 */
    UINT8   pad60[4];                   /* UNUSED: 0x384 */
    UINT32  sramErrCause;               /* 0x388 */
    UINT8   pad61[4];                   /* UNUSED: 0x38c */
    UINT32  sramErrAdrs;                /* 0x390 */
    UINT8   pad62[4];                   /* UNUSED: 0x394 */
    UINT32  sramErrDataLow;             /* 0x398 */
    UINT8   pad63[4];                   /* UNUSED: 0x39c */
    UINT32  sramErrDataHi;              /* 0x3a0 */
    UINT8   pad64[4];                   /* UNUSED: 0x3a4 */
    UINT32  sramErrParity;              /* 0x3a8 */
    UINT8   pad65[72];                  /* UNUSED: 0x3ac */
    UINT32  sramTestMode;               /* 0x3f4 */
    UINT32  sramErrAdrsHi;              /* 0x3f8 */
    UINT8   pad66[96];                  /* UNUSED: 0x3fc */
    UINT32  devbnk0Parms;               /* 0x45c */
    UINT32  devbnk1Parms;               /* 0x460 */
    UINT32  devbnk2Parms;               /* 0x464 */
    UINT32  devbnk3Parms;               /* 0x468 */
    UINT32  deviceBootBankParms;        /* 0x46c */
    UINT8   pad67[80];                  /* UNUSED: 0x470 */
    UINT32  deviceCtrl;                 /* 0x4c0 */
    UINT32  deviceCrossBarTimeout;      /* 0x4c4 */
    UINT32  deviceCrossBarCtrlLow;      /* 0x4c8 */
    UINT32  deviceCrossBarCtrlHi;       /* 0x4cc */
    UINT32  deviceIrqCause;             /* 0x4d0 */
    UINT32  deviceIrqMask;              /* 0x4d4 */
    UINT32  deviceErrorAdrs;            /* 0x4d8 */
    UINT32  deviceErrData;              /* 0x4dc */
    UINT32  deviceErrParity;            /* 0x4e0 */
    UINT8   pad68[796];                 /* UNUSED: 0x4e4 */
    UINT32  chan0DmaByteCount;          /* 0x800 */
    UINT32  chan1DmaByteCount;          /* 0x804 */
    UINT32  chan2DmaByteCount;          /* 0x808 */
    UINT32  chan3DmaByteCount;          /* 0x80c */
    UINT32  chan0DmaSrcAdrs;            /* 0x810 */
    UINT32  chan1DmaSrcAdrs;            /* 0x814 */
    UINT32  chan2DmaSrcAdrs;            /* 0x818 */
    UINT32  chan3DmaSrcAdrs;            /* 0x81c */
    UINT32  chan0DmaDstAdrs;            /* 0x820 */
    UINT32  chan1DmaDstAdrs;            /* 0x824 */
    UINT32  chan2DmaDstAdrs;            /* 0x828 */
    UINT32  chan3DmaDstAdrs;            /* 0x82c */
    UINT32  chan0nextRecPtr;            /* 0x830 */
    UINT32  chan1nextRecPtr;            /* 0x834 */
    UINT32  chan2nextRecPtr;            /* 0x838 */
    UINT32  chan3nextRecPtr;            /* 0x83c */
    UINT32  chan0Ctrl;                  /* 0x840 */
    UINT32  chan1Ctrl;                  /* 0x844 */
    UINT32  chan2Ctrl;                  /* 0x848 */
    UINT32  chan3Ctrl;                  /* 0x84c */
    UINT32  timerCounter0;              /* 0x850 */
    UINT32  timerCounter1;              /* 0x854 */
    UINT32  timerCounter2;              /* 0x858 */
    UINT32  timerCounter3;              /* 0x85c */
    UINT32  arbiterCtrl03;              /* 0x860 */
    UINT32  timerCounter03Ctrl;         /* 0x864 */
    UINT32  timerCounter03IrqCause;     /* 0x868 */
    UINT32  timerCounter03IrqMask;      /* 0x86c */
    UINT32  chan0CurDescrPtr;           /* 0x870 */
    UINT32  chan1CurDescrPtr;           /* 0x874 */
    UINT32  chan2CurDescrPtr;           /* 0x878 */
    UINT32  chan3CurDescrPtr;           /* 0x87c */
    UINT32  chan0CtrlHi;                /* 0x880 */
    UINT32  chan1CtrlHi;                /* 0x884 */
    UINT32  chan2CtrlHi;                /* 0x888 */
    UINT32  chan3CtrlHi;                /* 0x88c */
    UINT32  chan0DmaSrcHiPciAdrs;       /* 0x890 */
    UINT32  chan1DmaSrcHiPciAdrs;       /* 0x894 */
    UINT32  chan2DmaSrcHiPciAdrs;       /* 0x898 */
    UINT32  chan3DmaSrcHiPciAdrs;       /* 0x89c */
    UINT8   pad69[32];                  /* UNUSED: 0x8a0 */
    UINT32  chanels03IrqCause;          /* 0x8c0 */
    UINT32  chanels03IrqMask;           /* 0x8c4 */
    UINT32  chanels03ErrorAdrs;         /* 0x8c8 */
    UINT32  chanels03ErrorSelect;       /* 0x8cc */
    UINT8   pad70[304];                 /* UNUSED: 0x8d0 */
    UINT32  dmaBaseAddr0Decode;         /* 0xa00 */
    UINT32  dmaSizeReg0;                /* 0xa04 */
    UINT32  dmaBaseAddr1Decode;         /* 0xa08 */
    UINT32  dmaSizeReg1;                /* 0xa0c */
    UINT32  dmaBaseAddr2Decode;         /* 0xa10 */
    UINT32  dmaSizeReg2;                /* 0xa14 */
    UINT32  dmaBaseAddr3Decode;         /* 0xa18 */
    UINT32  dmaSizeReg3;                /* 0xa1c */
    UINT32  dmaBaseAddr4Decode;         /* 0xa20 */
    UINT32  dmaSizeReg4;                /* 0xa24 */
    UINT32  dmaBaseAddr5Decode;         /* 0xa28 */
    UINT32  dmaSizeReg5;                /* 0xa2c */
    UINT32  dmaBaseAddr6Decode;         /* 0xa30 */
    UINT32  dmaSizeReg6;                /* 0xa34 */
    UINT32  dmaBaseAddr7Decode;         /* 0xa38 */
    UINT32  dmaSizeReg7;                /* 0xa3c */
    UINT8   pad71[32];                  /* UNUSED: 0xa40 */
    UINT32  dmaHiAddr0Remap;            /* 0xa60 */
    UINT32  dmaHiAddr1Remap;            /* 0xa64 */
    UINT32  dmaHiAddr2Remap;            /* 0xa68 */
    UINT32  dmaHiAddr3Remap;            /* 0xa6c */
    UINT32  dmaAccProtectCh0;           /* 0xa70 */
    UINT32  dmaAccProtectCh1;           /* 0xa74 */
    UINT32  dmaAccProtectCh2;           /* 0xa78 */
    UINT32  dmaAccProtectCh3;           /* 0xa7c */
    UINT32  dmaBaseAddrEn;              /* 0xa80 */
    UINT32  dmaHeaderRetrgtCtrl;        /* 0xa84 */
    UINT32  dmaHeaderRetrgtBase;        /* 0xa88 */
    UINT8   pad72[372];                 /* UNUSED: 0xa8c */
    UINT32  pci0Command;                /* 0xc00 */
    UINT32  pci0TimeoutRetry;           /* 0xc04 */
    UINT32  pci0Cs0BankSize;            /* 0xc08 */
    UINT32  pci0Cs2BankSize;            /* 0xc0c */
    UINT32  pci0Devcs0BankSize;         /* 0xc10 */
    UINT32  pci0Devcs3BankSize;         /* 0xc14 */
    UINT8   pad73[16];                  /* UNUSED: 0xc18 */
    UINT32  pci0SerrMask;               /* 0xc28 */
    UINT8   pad74[8];                   /* UNUSED: 0xc2c */
    UINT32  pci0IrqAcknowledgeVirtual;  /* 0xc34 */
    UINT32  msi0TriggerTimer;           /* 0xc38 */
    UINT32  pci0BaseAdrsRegsEnable;     /* 0xc3c */
    UINT8   pad75[8];                   /* UNUSED: 0xc40 */
    UINT32  pci0Cs0BaseAdrsRemap;       /* 0xc48 */
    UINT32  pci0Cs2BaseAdrsRemap;       /* 0xc4c */
    UINT32  pci0Devcs0BaseAdrsRemap;    /* 0xc50 */
    UINT32  pci0Devcs3BaseAdrsRemap;    /* 0xc54 */
    UINT8   pad76[32];                  /* UNUSED: 0xc58 */
    UINT32  pci1CfgAdrs;                /* 0xc78 */
    UINT32  pci1CfgDataVirtual;         /* 0xc7c */
    UINT32  pci1Command;                /* 0xc80 */
    UINT32  pci1TimeoutRetry;           /* 0xc84 */
    UINT32  pci1Cs0BankSize;            /* 0xc88 */
    UINT32  pci1Cs2BankSize;            /* 0xc8c */
    UINT32  pci1Devcs0BankSize;         /* 0xc90 */
    UINT32  pci1Devcs3BankSize;         /* 0xc94 */
    UINT8   pad77[16];                  /* UNUSED: 0xc98 */
    UINT32  pci1SerrMask;               /* 0xca8 */
    UINT8   pad78[8];                   /* UNUSED: 0xcac */
    UINT32  pci1IrqAcknowledgeVirtual;  /* 0xcb4 */
    UINT32  msi1TriggerTimer;           /* 0xcb8 */
    UINT32  pci1BaseAdrsRegsEnable;     /* 0xcbc */
    UINT8   pad79[8];                   /* UNUSED: 0xcc0 */
    UINT32  pci1Cs0BaseAdrsRemap;       /* 0xcc8 */
    UINT32  pci1Cs2BaseAdrsRemap;       /* 0xccc */
    UINT32  pci1Devcs0BaseAdrsRemap;    /* 0xcd0 */
    UINT32  pci1Devcs3BaseAdrsRemap;    /* 0xcd4 */
    UINT8   pad80[32];                  /* UNUSED: 0xcd8 */
    UINT32  pci0CfgAdrs;                /* 0xcf8 */
    UINT32  pci0CfgDataVirtual;         /* 0xcfc */
    UINT32  pci0Mode;                   /* 0xd00 */
    UINT32  pci0ReadBufDiscardTimer;    /* 0xd04 */
    UINT32  pci0Cs1BankSize;            /* 0xd08 */
    UINT32  pci0Cs3BankSize;            /* 0xd0c */
    UINT32  pci0Devcs1BankSize;         /* 0xd10 */
    UINT32  pci0CsbootBankSize;         /* 0xd14 */
    UINT32  pci0Devcs2BankSize;         /* 0xd18 */
    UINT32  pci0P2pMem0BarSize;         /* 0xd1c */
    UINT32  pci0P2pMem1BarSize;         /* 0xd20 */
    UINT32  pci0P2pIoBarSize;           /* 0xd24 */
    UINT32  pci0CpuBarSize;             /* 0xd28 */
    UINT32  pci0ExpansionRomBarSize;    /* 0xd2c */
    UINT8   pad81[12];                  /* UNUSED: 0xd30 */
    UINT32  pci0AdrsDecodeCtrl;         /* 0xd3c */
    UINT8   pad82[8];                   /* UNUSED: 0xd40 */
    UINT32  pci0Cs1BaseAdrsRemap;       /* 0xd48 */
    UINT32  pci0Cs3BaseAdrsRemap;       /* 0xd4c */
    UINT32  pci0Devcs1BaseAdrsRemap;    /* 0xd50 */
    UINT32  pci0CsbootcsBaseAdrsRemap;  /* 0xd54 */
    UINT32  pci0Devcs2BaseAdrsRemap;    /* 0xd58 */
    UINT32  pci0P2pMem0BaseAdrsRemapLow; /* 0xd5c */
    UINT32  pci0P2pMem0BaseAdrsRemapHi; /* 0xd60 */
    UINT32  pci0P2pMem1BaseAdrsRemapLow; /* 0xd64 */
    UINT32  pci0P2pMem1BaseAdrsRemapHi; /* 0xd68 */
    UINT32  pci0P2pIoBaseAdrsRemap;     /* 0xd6c */
    UINT32  pci0CpuBaseAdrsRemap;       /* 0xd70 */
    UINT8   pad83[12];                  /* UNUSED: 0xd74 */
    UINT32  pci1Mode;                   /* 0xd80 */
    UINT32  pci1ReadBufDiscardTimer;    /* 0xd84 */
    UINT32  pci1Cs1BankSize;            /* 0xd88 */
    UINT32  pci1Cs3BankSize;            /* 0xd8c */
    UINT32  pci1Devcs1BankSize;         /* 0xd90 */
    UINT32  pci1CsbootBankSize;         /* 0xd94 */
    UINT32  pci1Devcs2BankSize;         /* 0xd98 */
    UINT32  pci1P2pMem0BarSize;         /* 0xd9c */
    UINT32  pci1P2pMem1BarSize;         /* 0xda0 */
    UINT32  pci1P2pIoBarSize;           /* 0xda4 */
    UINT32  pci1CpuBarSize;             /* 0xda8 */
    UINT32  pci1ExpansionRomBarSize;    /* 0xdac */
    UINT8   pad84[12];                  /* UNUSED: 0xdb0 */
    UINT32  pci1AdrsDecodeCtrl;         /* 0xdbc */
    UINT8   pad85[8];                   /* UNUSED: 0xdc0 */
    UINT32  pci1Cs1BaseAdrsRemap;       /* 0xdc8 */
    UINT32  pci1Cs3BaseAdrsRemap;       /* 0xdcc */
    UINT32  pci1Devcs1BaseAdrsRemap;    /* 0xdd0 */
    UINT32  pci1CsbootcsBaseAdrsRemap;  /* 0xdd4 */
    UINT32  pci1Devcs2BaseAdrsRemap;    /* 0xdd8 */
    UINT32  pci1P2pMem0BaseAdrsRemapLow; /* 0xddc */
    UINT32  pci1P2pMem0BaseAdrsRemapHi; /* 0xde0 */
    UINT32  pci1P2pMem1BaseAdrsRemapLow; /* 0xde4 */
    UINT32  pci1P2pMem1BaseAdrsRemapHi; /* 0xde8 */
    UINT32  pci1P2pIoBaseAdrsRemap;     /* 0xdec */
    UINT32  pci1CpuBaseAdrsRemap;       /* 0xdf0 */
    UINT8   pad86[12];                  /* UNUSED: 0xdf4 */
    UINT32  pci0SramBarSize;            /* 0xe00 */
    UINT8   pad87[124];                 /* UNUSED: 0xe04 */
    UINT32  pci1SramBarSize;            /* 0xe80 */
    UINT8   pad88[180];                 /* UNUSED: 0xe84 */
    UINT32  pci0ExpansionRomBaseAdrsRemap; /* 0xf38 */
    UINT8   pad89[4];                   /* UNUSED: 0xf3c */
    UINT32  pci0HeaderRetrgtCtrl;       /* 0xf40 */
    UINT32  pci0HeaderRetrgtBase;       /* 0xf44 */
    UINT32  pci0HeaderRetrgtBaseHi;     /* 0xf48 */
    UINT8   pad90[108];                 /* UNUSED: 0xf4c */
    UINT32  pci1ExpansionRomBaseAdrsRemap; /* 0xfb8 */
    UINT8   pad91[4];                   /* UNUSED: 0xfbc */
    UINT32  pci1HeaderRetrgtCtrl;       /* 0xfc0 */
    UINT32  pci1HeaderRetrgtBase;       /* 0xfc4 */
    UINT32  pci1HeaderRetrgtBaseHi;     /* 0xfc8 */
    UINT8   pad92[1076];                /* UNUSED: 0xfcc */
    UINT32  sdramCfg;                   /* 0x1400 */
    UINT32  dunitCtrlLow;               /* 0x1404 */
    UINT32  sdramTimingCtrlLow;         /* 0x1408 */
    UINT32  sdramTimingCtrlHi;          /* 0x140c */
    UINT32  sdramAdrsDecode;            /* 0x1410 */
    UINT32  sdramOpenPgCtrl;            /* 0x1414 */
    UINT32  sdramOperationMode;         /* 0x1418 */
    UINT8   pad93[4];                   /* UNUSED: 0x141c */
    UINT32  sdramExtMode;               /* 0x1420 */
    UINT32  dunitCtrlHi;                /* 0x1424 */
    UINT8   pad94[8];                   /* UNUSED: 0x1428 */
    UINT32  sdramCrossBarCtrlLow;       /* 0x1430 */
    UINT32  sdramCrossBarCtrlHi;        /* 0x1434 */
    UINT32  sdramCrossBarTimeout;       /* 0x1438 */
    UINT8   pad95[4];                   /* UNUSED: 0x143c */
    UINT32  sdramErrorDataHi;           /* 0x1440 */
    UINT32  sdramErrorDataLow;          /* 0x1444 */
    UINT32  sdramReceivedEcc;           /* 0x1448 */
    UINT32  sdramCalculatedEcc;         /* 0x144c */
    UINT32  sdramAndDeviceErrorAdrs;    /* 0x1450 */
    UINT32  sdramEccCtrl;               /* 0x1454 */
    UINT32  sdramEccErrorCounter;       /* 0x1458 */
    UINT8   pad96[1972];                /* UNUSED: 0x145c */
    UINT32  inbMsgReg0CpuSidePci0;      /* 0x1c10 */
    UINT32  inbMsgReg1CpuSidePci0;      /* 0x1c14 */
    UINT32  outbMsgReg0CpuSidePci0;     /* 0x1c18 */
    UINT32  outbMsgReg1CpuSidePci0;     /* 0x1c1c */
    UINT32  inbDoorbellCpuSidePci0;     /* 0x1c20 */
    UINT32  inbIrqCauseCpuSidePci0;     /* 0x1c24 */
    UINT32  inbIrqMaskCpuSidePci0;      /* 0x1c28 */
    UINT32  outbDoorbellCpuSidePci0;    /* 0x1c2c */
    UINT32  outbIrqCauseCpuSidePci0;    /* 0x1c30 */
    UINT32  outbIrqMaskCpuSidePci0;     /* 0x1c34 */
    UINT8   pad97[8];                   /* UNUSED: 0x1c38 */
    UINT32  inbQueuePortVirtualCpuSidePci0; /* 0x1c40 */
    UINT32  outbQueuePortVirtualCpuSidePci0; /* 0x1c44 */
    UINT8   pad98[8];                   /* UNUSED: 0x1c48 */
    UINT32  queueCtrlCpuSidePci0;       /* 0x1c50 */
    UINT32  queueBaseAdrsCpuSidePci0;   /* 0x1c54 */
    UINT8   pad99[8];                   /* UNUSED: 0x1c58 */
    UINT32  inbFreeHeadPtrCpuSidePci0;  /* 0x1c60 */
    UINT32  inbFreeTailPtrCpuSidePci0;  /* 0x1c64 */
    UINT32  inbPostHeadPtrCpuSidePci0;  /* 0x1c68 */
    UINT32  inbPostTailPtrCpuSidePci0;  /* 0x1c6c */
    UINT32  outbFreeHeadPtrCpuSidePci0; /* 0x1c70 */
    UINT32  outbFreeTailPtrCpuSidePci0; /* 0x1c74 */
    UINT32  outbPostHeadPtrCpuSidePci0; /* 0x1c78 */
    UINT32  outbPostTailPtrCpuSidePci0; /* 0x1c7c */
    UINT8   pad100[16];                 /* UNUSED: 0x1c80 */
    UINT32  inbMsgReg0CpuSidePci1;      /* 0x1c90 */
    UINT32  inbMsgReg1CpuSidePci1;      /* 0x1c94 */
    UINT32  outbMsgReg0CpuSidePci1;     /* 0x1c98 */
    UINT32  outbMsgReg1CpuSidePci1;     /* 0x1c9c */
    UINT32  inbDoorbellCpuSidePci1;     /* 0x1ca0 */
    UINT32  inbIrqCauseCpuSidePci1;     /* 0x1ca4 */
    UINT32  inbIrqMaskCpuSidePci1;      /* 0x1ca8 */
    UINT32  outbDoorbellCpuSidePci1;    /* 0x1cac */
    UINT32  outbIrqCauseCpuSidePci1;    /* 0x1cb0 */
    UINT32  outbIrqMaskCpuSidePci1;     /* 0x1cb4 */
    UINT8   pad101[8];                  /* UNUSED: 0x1cb8 */
    UINT32  inbQueuePortVirtualCpuSidePci1; /* 0x1cc0 */
    UINT32  outbQueuePortVirtualCpuSidePci1; /* 0x1cc4 */
    UINT8   pad102[8];                  /* UNUSED: 0x1cc8 */
    UINT32  queueCtrlCpuSidePci1;       /* 0x1cd0 */
    UINT32  queueBaseAdrsCpuSidePci1;   /* 0x1cd4 */
    UINT8   pad103[8];                  /* UNUSED: 0x1cd8 */
    UINT32  inbFreeHeadPtrCpuSidePci1;  /* 0x1ce0 */
    UINT32  inbFreeTailPtrCpuSidePci1;  /* 0x1ce4 */
    UINT32  inbPostHeadPtrCpuSidePci1;  /* 0x1ce8 */
    UINT32  inbPostTailPtrCpuSidePci1;  /* 0x1cec */
    UINT32  outbFreeHeadPtrCpuSidePci1; /* 0x1cf0 */
    UINT32  outbFreeTailPtrCpuSidePci1; /* 0x1cf4 */
    UINT32  outbPostHeadPtrCpuSidePci1; /* 0x1cf8 */
    UINT32  outbPostTailPtrCpuSidePci1; /* 0x1cfc */
    UINT32  pci0ArbiterCtrl;            /* 0x1d00 */
    UINT32  pci0CrossBarTimeout;        /* 0x1d04 */
    UINT32  pci0CrossBarCtrlLow;        /* 0x1d08 */
    UINT32  pci0CrossBarCtrlHi;         /* 0x1d0c */
    UINT32  pci0SyncBarrierVirtual;     /* 0x1d10 */
    UINT32  pci0P2pCfg;                 /* 0x1d14 */
    UINT32  pci0SyncBarrierTrigger;     /* 0x1d18 */
    UINT32  pci0MppPadsCalibration;     /* 0x1d1c */
    UINT32  pci0DllStatusCtrl;          /* 0x1d20 */
    UINT32  pci0Mmask;                  /* 0x1d24 */
    UINT8   pad104[24];                 /* UNUSED: 0x1d28 */
    UINT32  pci0ErrorAdrsLow;           /* 0x1d40 */
    UINT32  pci0ErrorAdrsHi;            /* 0x1d44 */
    UINT32  pci0ErrorAttrib;            /* 0x1d48 */
    UINT8   pad105[12];                 /* UNUSED: 0x1d4c */
    UINT32  pci0ErrorCause;             /* 0x1d58 */
    UINT32  pci0ErrorMask;              /* 0x1d5c */
    UINT8   pad106[32];                 /* UNUSED: 0x1d60 */
    UINT32  pci1ArbiterCtrl;            /* 0x1d80 */
    UINT32  pci1CrossBarTimeout;        /* 0x1d84 */
    UINT32  pci1CrossBarCtrlLow;        /* 0x1d88 */
    UINT32  pci1CrossBarCtrlHi;         /* 0x1d8c */
    UINT32  pci1SyncBarrierVirtual;     /* 0x1d90 */
    UINT32  pci1P2pCfg;                 /* 0x1d94 */
    UINT32  pci1SyncBarrierTrigger;     /* 0x1d98 */
    UINT32  pci1MppPadsCalibration;     /* 0x1d9c */
    UINT32  pci1DllStatusCtrl;          /* 0x1da0 */
    UINT32  pci1Mmask;                  /* 0x1da4 */
    UINT8   pad107[24];                 /* UNUSED: 0x1da8 */
    UINT32  pci1ErrorAdrsLow;           /* 0x1dc0 */
    UINT32  pci1ErrorAdrsHi;            /* 0x1dc4 */
    UINT32  pci1ErrorAttrib;            /* 0x1dc8 */
    UINT8   pad108[12];                 /* UNUSED: 0x1dcc */
    UINT32  pci1ErrorCause;             /* 0x1dd8 */
    UINT32  pci1ErrorMask;              /* 0x1ddc */
    UINT8   pad109[32];                 /* UNUSED: 0x1de0 */
    UINT32  pci0AccessCtrlBase0Low;     /* 0x1e00 */
    UINT32  pci0AccessCtrlBase0Hi;      /* 0x1e04 */
    UINT32  pci0AccessCtrlTop0;         /* 0x1e08 */
    UINT8   pad110[4];                  /* UNUSED: 0x1e0c */
    UINT32  pci0AccessCtrlBase1Low;     /* 0x1e10 */
    UINT32  pci0AccessCtrlBase1Hi;      /* 0x1e14 */
    UINT32  pci0AccessCtrlTop1;         /* 0x1e18 */
    UINT8   pad111[4];                  /* UNUSED: 0x1e1c */
    UINT32  pci0AccessCtrlBase2Low;     /* 0x1e20 */
    UINT32  pci0AccessCtrlBase2Hi;      /* 0x1e24 */
    UINT32  pci0AccessCtrlTop2;         /* 0x1e28 */
    UINT8   pad112[4];                  /* UNUSED: 0x1e2c */
    UINT32  pci0AccessCtrlBase3Low;     /* 0x1e30 */
    UINT32  pci0AccessCtrlBase3Hi;      /* 0x1e34 */
    UINT32  pci0AccessCtrlTop3;         /* 0x1e38 */
    UINT8   pad113[4];                  /* UNUSED: 0x1e3c */
    UINT32  pci0AccessCtrlBase4Low;     /* 0x1e40 */
    UINT32  pci0AccessCtrlBase4Hi;      /* 0x1e44 */
    UINT32  pci0AccessCtrlTop4;         /* 0x1e48 */
    UINT8   pad114[4];                  /* UNUSED: 0x1e4c */
    UINT32  pci0AccessCtrlBase5Low;     /* 0x1e50 */
    UINT32  pci0AccessCtrlBase5Hi;      /* 0x1e54 */
    UINT32  pci0AccessCtrlTop5;         /* 0x1e58 */
    UINT8   pad115[36];                 /* UNUSED: 0x1e5c */
    UINT32  pci1AccessCtrlBase0Low;     /* 0x1e80 */
    UINT32  pci1AccessCtrlBase0Hi;      /* 0x1e84 */
    UINT32  pci1AccessCtrlTop0;         /* 0x1e88 */
    UINT8   pad116[4];                  /* UNUSED: 0x1e8c */
    UINT32  pci1AccessCtrlBase1Low;     /* 0x1e90 */
    UINT32  pci1AccessCtrlBase1Hi;      /* 0x1e94 */
    UINT32  pci1AccessCtrlTop1;         /* 0x1e98 */
    UINT8   pad117[4];                  /* UNUSED: 0x1e9c */
    UINT32  pci1AccessCtrlBase2Low;     /* 0x1ea0 */
    UINT32  pci1AccessCtrlBase2Hi;      /* 0x1ea4 */
    UINT32  pci1AccessCtrlTop2;         /* 0x1ea8 */
    UINT8   pad118[4];                  /* UNUSED: 0x1eac */
    UINT32  pci1AccessCtrlBase3Low;     /* 0x1eb0 */
    UINT32  pci1AccessCtrlBase3Hi;      /* 0x1eb4 */
    UINT32  pci1AccessCtrlTop3;         /* 0x1eb8 */
    UINT8   pad119[4];                  /* UNUSED: 0x1ebc */
    UINT32  pci1AccessCtrlBase4Low;     /* 0x1ec0 */
    UINT32  pci1AccessCtrlBase4Hi;      /* 0x1ec4 */
    UINT32  pci1AccessCtrlTop4;         /* 0x1ec8 */
    UINT8   pad120[4];                  /* UNUSED: 0x1ecc */
    UINT32  pci1AccessCtrlBase5Low;     /* 0x1ed0 */
    UINT32  pci1AccessCtrlBase5Hi;      /* 0x1ed4 */
    UINT32  pci1AccessCtrlTop5;         /* 0x1ed8 */
    UINT8   pad121[292];                /* UNUSED: 0x1edc */
    UINT32  ethPhyAdrs;                 /* 0x2000 */
    UINT32  ethSmi;                     /* 0x2004 */
    UINT32  ethDefaultAdrs;             /* 0x2008 */
    UINT32  ethDefaultId;               /* 0x200c */
    UINT8   pad122[112];                /* UNUSED: 0x2010 */
    UINT32  ethIntCause;                /* 0x2080 */
    UINT32  ethIntMask;                 /* 0x2084 */
    UINT8   pad123[12];                 /* UNUSED: 0x2088 */
    UINT32  ethErrAdrs;                 /* 0x2094 */
    UINT32  ethInternalAdrsErr;         /* 0x2098 */
    UINT8   pad124[356];                /* UNUSED: 0x209c */
    UINT32  ethWindow0BaseAdrs;         /* 0x2200 */
    UINT32  ethWindow0SizeAdrs;         /* 0x2204 */
    UINT32  ethWindow1BaseAdrs;         /* 0x2208 */
    UINT32  ethWindow1SizeAdrs;         /* 0x220c */
    UINT32  ethWindow2BaseAdrs;         /* 0x2210 */
    UINT32  ethWindow2SizeAdrs;         /* 0x2214 */
    UINT32  ethWindow3BaseAdrs;         /* 0x2218 */
    UINT32  ethWindow3SizeAdrs;         /* 0x221c */
    UINT32  ethWindow4BaseAdrs;         /* 0x2220 */
    UINT32  ethWindow4SizeAdrs;         /* 0x2224 */
    UINT32  ethWindow5BaseAdrs;         /* 0x2228 */
    UINT32  ethWindow5SizeAdrs;         /* 0x222c */
    UINT32  headerRetargetBase;         /* 0x2230 */
    UINT32  headerRetargetCtrl;         /* 0x2234 */
    UINT8   pad125[72];                 /* UNUSED: 0x2238 */
    UINT32  ethAdrsRemap0Hi;            /* 0x2280 */
    UINT32  ethAdrsRemap1Hi;            /* 0x2284 */
    UINT32  ethAdrsRemap2Hi;            /* 0x2288 */
    UINT32  ethAdrsRemap3Hi;            /* 0x228c */
    UINT32  ethBaseAdrsEnable;          /* 0x2290 */
    UINT32  eth0AccessProtect;          /* 0x2294 */
    UINT32  eth1AccessProtect;          /* 0x2298 */
    UINT32  eth2AccessProtect;          /* 0x229c */
    UINT8   pad126[352];                /* UNUSED: 0x22a0 */
    UINT32  eth0PortCfg;                /* 0x2400 */
    UINT32  eth0PortCfgExtend;          /* 0x2404 */
    UINT32  eth0MiiSerialParams;        /* 0x2408 */
    UINT32  eth0GmiiSerialParams;       /* 0x240c */
    UINT32  eth0VlanType;               /* 0x2410 */
    UINT32  eth0MacAddrLow;             /* 0x2414 */
    UINT32  eth0MacAddrHi;              /* 0x2418 */
    UINT32  eth0SdmaCfg;                /* 0x241c */
    UINT8   pad127[28];                 /* UNUSED: 0x2420 */
    UINT32  eth0SerialCtrl;             /* 0x243c */
    UINT8   pad128[4];                  /* UNUSED: 0x2440 */
    UINT32  eth0PortStatus;             /* 0x2444 */
    UINT8   pad129[16];                 /* UNUSED: 0x2448 */
    UINT32  eth0MaxTxUnit;              /* 0x2458 */
    UINT8   pad130[4];                  /* UNUSED: 0x245c */
    UINT32  eth0PortIntCause;           /* 0x2460 */
    UINT32  eth0PortExtIntCause;        /* 0x2464 */
    UINT32  eth0PortIntMask;            /* 0x2468 */
    UINT32  eth0PortExtIntMask;         /* 0x246c */
    UINT8   pad131[36];                 /* UNUSED: 0x2470 */
    UINT32  eth0PortInternalErr;        /* 0x2494 */
    UINT8   pad132[872];                /* UNUSED: 0x2498 */
    UINT32  eth1PortCfg;                /* 0x2800 */
    UINT32  eth1PortCfgExtend;          /* 0x2804 */
    UINT32  eth1MiiSerialParams;        /* 0x2808 */
    UINT32  eth1GmiiSerialParams;       /* 0x280c */
    UINT32  eth1VlanType;               /* 0x2810 */
    UINT32  eth1MacAddrLow;             /* 0x2814 */
    UINT32  eth1MacAddrHi;              /* 0x2818 */
    UINT32  eth1SdmaCfg;                /* 0x281c */
    UINT8   pad133[28];                 /* UNUSED: 0x2820 */
    UINT32  eth1SerialCtrl;             /* 0x283c */
    UINT8   pad134[4];                  /* UNUSED: 0x2840 */
    UINT32  eth1PortStatus;             /* 0x2844 */
    UINT8   pad135[16];                 /* UNUSED: 0x2848 */
    UINT32  eth1MaxTxUnit;              /* 0x2858 */
    UINT8   pad136[4];                  /* UNUSED: 0x285c */
    UINT32  eth1PortIntCause;           /* 0x2860 */
    UINT32  eth1PortExtIntCause;        /* 0x2864 */
    UINT32  eth1PortIntMask;            /* 0x2868 */
    UINT32  eth1PortExtIntMask;         /* 0x286c */
    UINT8   pad137[36];                 /* UNUSED: 0x2870 */
    UINT32  eth1PortInternalErr;        /* 0x2894 */
    UINT8   pad138[872];                /* UNUSED: 0x2898 */
    UINT32  eth2PortCfg;                /* 0x2c00 */
    UINT32  eth2PortCfgExtend;          /* 0x2c04 */
    UINT32  eth2MiiSerialParams;        /* 0x2c08 */
    UINT32  eth2GmiiSerialParams;       /* 0x2c0c */
    UINT32  eth2VlanType;               /* 0x2c10 */
    UINT32  eth2MacAddrLow;             /* 0x2c14 */
    UINT32  eth2MacAddrHi;              /* 0x2c18 */
    UINT32  eth2SdmaCfg;                /* 0x2c1c */
    UINT8   pad139[28];                 /* UNUSED: 0x2c20 */
    UINT32  eth2SerialCtrl;             /* 0x2c3c */
    UINT8   pad140[4];                  /* UNUSED: 0x2c40 */
    UINT32  eth2PortStatus;             /* 0x2c44 */
    UINT8   pad141[16];                 /* UNUSED: 0x2c48 */
    UINT32  eth2MaxTxUnit;              /* 0x2c58 */
    UINT8   pad142[4];                  /* UNUSED: 0x2c5c */
    UINT32  eth2PortIntCause;           /* 0x2c60 */
    UINT32  eth2PortExtIntCause;        /* 0x2c64 */
    UINT32  eth2PortIntMask;            /* 0x2c68 */
    UINT32  eth2PortExtIntMask;         /* 0x2c6c */
    UINT8   pad143[36];                 /* UNUSED: 0x2c70 */
    UINT32  eth2PortInternalErr;        /* 0x2c94 */
    UINT8   pad144[4968];               /* UNUSED: 0x2c98 */
    UINT32  chan0Cfg;                   /* 0x4000 */
    UINT8   pad145[4];                  /* UNUSED: 0x4004 */
    UINT32  chan0Command;               /* 0x4008 */
    UINT8   pad146[4084];               /* UNUSED: 0x400c */
    UINT32  chan1Cfg;                   /* 0x5000 */
    UINT8   pad147[4];                  /* UNUSED: 0x5004 */
    UINT32  chan1Command;               /* 0x5008 */
    UINT8   pad148[12276];              /* UNUSED: 0x500c */
    MPSC_REGS mpsc0Low;                 /* 0x8000 */
    UINT8   pad149[4044];               /* UNUSED: 0x8034 */
    MPSC_REGS mpsc1Low;                 /* 0x9000 */
    UINT8   pad150[8652];               /* UNUSED: 0x9034 */
    BRG_REGS brg0;                      /* 0xb200 */
    BRG_REGS brg1;                      /* 0xb208 */
    UINT8   pad151[496];                /* UNUSED: 0xb210 */
    UINT32  mainRouting;                /* 0xb400 */
    UINT32  rxClockRouting;             /* 0xb404 */
    UINT32  txClockRouting;             /* 0xb408 */
    UINT32  commUnitConfiguration;      /* 0xb40c */
    UINT32  watchdogCfg;                /* 0xb410 */
    UINT32  watchdogValue;              /* 0xb414 */
    UINT8   pad152[1000];               /* UNUSED: 0xb418 */
    UINT32  sdmaCause;                  /* 0xb800 */
    MPSC_CAUSE_REGS mpsc0Cause;         /* 0xb804 */
    UINT8   pad153[4];                  /* UNUSED: 0xb808 */
    MPSC_CAUSE_REGS mpsc1Cause;         /* 0xb80c */
    UINT8   pad154[36];                 /* UNUSED: 0xb810 */
    UINT32  brgCause;                   /* 0xb834 */
    UINT8   pad155[72];                 /* UNUSED: 0xb838 */
    UINT32  sdmaMask;                   /* 0xb880 */
    UINT32  mpsc0Mask;                  /* 0xb884 */
    UINT8   pad156[4];                  /* UNUSED: 0xb888 */
    UINT32  mpsc1Mask;                  /* 0xb88c */
    UINT8   pad157[36];                 /* UNUSED: 0xb890 */
    UINT32  brgMask;                    /* 0xb8b4 */
    UINT8   pad158[1864];               /* UNUSED: 0xb8b8 */
    UINT32  twsiSlaveAdrs;              /* 0xc000 */
    UINT32  twsiData;                   /* 0xc004 */
    UINT32  twsiCtrl;                   /* 0xc008 */
    UINT32  twsiStatusBaudeRate;        /* 0xc00c */
    UINT32  twsiExtendedSlaveAdrs;      /* 0xc010 */
    UINT8   pad159[8];                  /* UNUSED: 0xc014 */
    UINT32  twsiSoftReset;              /* 0xc01c */
    UINT8   pad160[12256];              /* UNUSED: 0xc020 */
    UINT32  mppCtrl0;                   /* 0xf000 */
    UINT32  mppCtrl1;                   /* 0xf004 */
    UINT32  mppCtrl2;                   /* 0xf008 */
    UINT32  mppCtrl3;                   /* 0xf00c */
    UINT8   pad161[240];                /* UNUSED: 0xf010 */
    UINT32  gppIoCtrl;                  /* 0xf100 */
    UINT32  gppValue;                   /* 0xf104 */
    UINT32  gppIrqCause;                /* 0xf108 */
    UINT32  gppIrqMask0;                /* 0xf10c */
    UINT32  gppLevelCtrl;               /* 0xf110 */
    UINT32  gppIrqMask1;                /* 0xf114 */
    UINT8   pad162[232];                /* UNUSED: 0xf118 */
    UINT32  mpscWindow0BaseAdrs;        /* 0xf200 */
    UINT32  mpscWindow0SizeReg;         /* 0xf204 */
    UINT32  mpscWindow1BaseAdrs;        /* 0xf208 */
    UINT32  mpscWindow1SizeReg;         /* 0xf20c */
    UINT32  mpscWindow2BaseAdrs;        /* 0xf210 */
    UINT32  mpscWindow2SizeReg;         /* 0xf214 */
    UINT32  mpscWindow3BaseAdrs;        /* 0xf218 */
    UINT32  mpscWindow3SizeReg;         /* 0xf21c */
    UINT8   pad163[32];                 /* UNUSED: 0xf220 */
    UINT32  mpscAddrRemapHi0;           /* 0xf240 */
    UINT32  mpscAddrRemapHi1;           /* 0xf244 */
    UINT8   pad164[8];                  /* UNUSED: 0xf248 */
    UINT32  mpscBaseAddrEnable;         /* 0xf250 */
    UINT32  mpsc0AccessProtect;         /* 0xf254 */
    UINT32  mpsc1AccessProtect;         /* 0xf258 */
    UINT32  mpscInternalSpaceAddr;      /* 0xf25c */
    UINT8   pad165[160];                /* UNUSED: 0xf260 */
    UINT32  commUnitArbiterCtrl;        /* 0xf300 */
    UINT32  commUnitCrossBarTimeout;    /* 0xf304 */
    UINT8   pad166[8];                  /* UNUSED: 0xf308 */
    UINT32  commUnitIrqCause;           /* 0xf310 */
    UINT32  commUnitIrqMask;            /* 0xf314 */
    UINT32  commUnitErrorAdrs;          /* 0xf318 */
    UINT8   pad167[8];                  /* UNUSED: 0xf31c */
    UINT32  serialInitLastData;         /* 0xf324 */
    UINT32  serialInitCtrl;             /* 0xf328 */
    UINT32  serialInitStatus;           /* 0xf32c */
    } MV64360_REGS;


typedef struct 
    {
    UINT32  pciDeviceAndVendorId;       /* 0x0 */
    UINT32  pciStatusAndCommand;        /* 0x4 */
    UINT32  pciClassCodeAndRevisionId;  /* 0x8 */
    UINT32  pciBistHeaderTypeLatencyTimerCacheLine; /* 0xc */
    UINT32  pciCs0BaseAdrsLow;          /* 0x10 */
    UINT32  pciCs0BaseAdrsHi;           /* 0x14 */
    UINT32  pciCs1BaseAdrsLow;          /* 0x18 */
    UINT32  pciCs1BaseAdrsHi;           /* 0x1c */
    UINT32  pciInternalRegsMemMappedBaseAdrs; /* 0x20 */
    UINT8   pad1[8];                    /* UNUSED: 0x24 */
    UINT32  pciSubsystemIdAndSubsystemVendorId; /* 0x2c */
    UINT32  pciExpansionRomBaseAdrs;    /* 0x30 */
    UINT32  pciCapabiltyListPtr;        /* 0x34 */
    UINT8   pad2[4];                    /* UNUSED: 0x38 */
    UINT32  pciIrqPinAndLine;           /* 0x3c */
    UINT32  pciPowerManagementCapability; /* 0x40 */
    UINT32  pciPowerManagementStatusAndCtrl; /* 0x44 */
    UINT32  pciVpdAdrs;                 /* 0x48 */
    UINT32  pciVpdData;                 /* 0x4c */
    UINT32  pciMsiMsgCtrl;              /* 0x50 */
    UINT32  pciMsiMsgAdrs;              /* 0x54 */
    UINT32  pciMsiMsgUpperAdrs;         /* 0x58 */
    UINT32  pciMsiMsgData;              /* 0x5c */
    UINT32  pciXCmd;                    /* 0x60 */
    UINT32  pciXStatus;                 /* 0x64 */
    UINT32  pciCompactPciHotSwapCapability; /* 0x68 */
    UINT8   pad3[164];                  /* UNUSED: 0x6c */
    UINT32  pciCs2BaseAdrsLow;          /* 0x110 */
    UINT32  pciCs2BaseAdrsHi;           /* 0x114 */
    UINT32  pciCs3BaseAdrsLow;          /* 0x118 */
    UINT32  pciCs3BaseAdrsHi;           /* 0x11c */
    UINT32  pciSramBaseAdrsLow;         /* 0x120 */
    UINT32  pciSramBaseAdrsHi;          /* 0x124 */
    UINT8   pad4[232];                  /* UNUSED: 0x128 */
    UINT32  pciDcs0BaseAdrsLow;         /* 0x210 */
    UINT32  pciDcs0BaseAdrsHi;          /* 0x214 */
    UINT32  pciDcs1BaseAdrsLow;         /* 0x218 */
    UINT32  pciDcs1BaseAdrsHi;          /* 0x21c */
    UINT32  pciDcs2BaseAdrsLow;         /* 0x220 */
    UINT32  pciDcs2BaseAdrsHi;          /* 0x224 */
    UINT8   pad5[232];                  /* UNUSED: 0x228 */
    UINT32  pciDcs3BaseAdrsLow;         /* 0x310 */
    UINT32  pciDcs3BaseAdrsHi;          /* 0x314 */
    UINT32  pciBootcsBaseAdrsLow;       /* 0x318 */
    UINT32  pciBootcsBaseAdrsHi;        /* 0x31c */
    UINT32  pciCpuBaseAdrsLow;          /* 0x320 */
    UINT32  pciCpuBaseAdrsHi;           /* 0x324 */
    UINT8   pad6[232];                  /* UNUSED: 0x328 */
    UINT32  pciP2pMem0BaseAdrsLow;      /* 0x410 */
    UINT32  pciP2pMem0BaseAdrsHi;       /* 0x414 */
    UINT32  pciP2pMem1BaseAdrsLow;      /* 0x418 */
    UINT32  pciP2pMem1BaseAdrsHi;       /* 0x41c */
    UINT32  pciP2pIOBaseAdrs;           /* 0x420 */
    UINT32  pciInternalRegIOMapBaseAdrs; /* 0x424 */
    } PCICFG0_REGS;


